app/Controllers/LoginController.php

public function login()
{
$email = $this->request->getVar('email');
$password = $this->request->getVar('password');

$model = new MMember();
$member = $model->where(['email' => $email])->first();
---
SELECT *
FROM `member`
WHERE `email` = 'leksa@gmail.com'
 LIMIT 1