app/Controllers/ProdukController.php

INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('KODE001', 'Teh Gelas', '2000')
SELECT *
FROM `produk`
WHERE `produk`.`id` = 8
---
    public function create()
    {
        $data = [
            'kode_produk' => $this->request->getVar('kode_produk'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'harga' => $this->request->getVar('harga')
        ];
        $model = new MProduk();
        $model->insert($data);
        $produk = $model->find($model->getInsertID());

SELECT *
FROM `produk`
---
    public function list()
    {
        $model = new MProduk();
        $produk = $model->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id` = '12'
---
    public function detail($id)
    {
        $model = new MProduk();
        $produk = $model->find($id);

SELECT *
FROM `produk`
WHERE `produk`.`id` = '12'
---
    public function ubah($id)
    {
        $json = $this->request->getJSON(true);
        $data = [
            'kode_produk' => $json['kode_produk'],
            'nama_produk' => $json['nama_produk'],
            'harga' => $json['harga']
        ];

        $model = new MProduk();
        $updated = $model->update($id, $data);

        if ($updated) {
            $produk = $model->find($id);

DELETE FROM `produk`
WHERE `id` IN ('13')
---
    public function hapus($id)
    {
        $model = new MProduk();
        $produk = $model->delete($id);