app/Controllers/ProdukController.php

DELETE FROM `produk`
WHERE `id` IN ('1')
---
public function hapus($id)
{
$model = new MProduk();
$produk = $model->delete($id);